$(function() {
	
	
	var vTitleTextStyle = {
			color : '#FFFFFF',
			fontFamily : "微软雅黑",
			fontSize : 26
		};
		var vLegendTextStyle = {
			color : '#FFFFFF',
			fontFamily : "微软雅黑",
			fontSize : 20
		};
		var vLineStyle={normal:{width:4}};
		var option, mychart;
		// ---养老分布---
		// 曲靖行政区域
		// '麒麟区', '陆良县', '罗平县', '富源县', '会泽县', '马龙县', '沽益县','师宗县','宣威市','开发区'
    // 114607, 89536, 73794, 82449, 134874, 27580, 59950, 48532,198386,5420
var geoCoordMap = {
"南宁街道":[103.816346,25.495665 ],
"建宁街道":[103.794208,25.517517],
"白石江街道":[103.81359,25.530444],
"寥廓街道":[103.806223,25.479036],
"西城街道":[103.740406,25.523501],
"三宝镇":[103.835475,25.42631],
"越州镇":[103.854271,25.472413],
"东山镇":[103.892976,25.511156],
"珠街乡":[103.877084,25.30505],
"沿江乡":[104.073266,25.261654],
"茨营乡":[103.919924,25.361941],
"通泉镇":[103.59166,25.435005],
"王家庄镇":[103.50865,25.481593],
"旧县镇":[103.39995,25.373346],
"马过河镇":[103.399698,25.458934],
"纳章镇":[103.583383,25.272483],
"马鸣乡":[103.384491,25.275278],
"大庄乡":[103.47007,25.222935],
"月望乡":[103.644708,25.334897],
"中枢镇":[103.673764,25.025499],
"板桥镇":[103.754692,25.127805],
"三岔河镇":[103.778623,25.05051],
"马街镇":[103.767575,24.962231],
"召夸镇":[103.699845,24.848234],
"大莫古镇":[103.521259,24.906233],
"芳华镇":[103.687408,25.168143],
"小百户镇":[103.579758,25.050312],
"活水乡":[103.961887,25.127129],
"龙海乡":[103.84223,24.953498],
"陆良华侨管理区":[103.705089,25.024768],
"丹凤镇":[104.086208,24.776919],
"雄壁镇":[103.835343,24.876015],
"葵山镇":[103.81892,24.775643],
"彩云镇":[103.926469,24.706158],
"竹基镇":[104.050384,24.919742],
"龙庆乡":[104.08731,24.555392],
"五龙乡":[104.29433,24.62811],
"高良乡":[104.354276,24.522385],
"罗雄镇":[104.315109,24.890596],
"九龙镇":[104.301885,24.963415],
"板桥镇":[104.496417,24.972386],
"马街镇":[104.247342,25.161262],
"富乐镇":[104.387098,25.36169],
"阿岗镇":[104.1159,25.079583],
"大水井乡":[104.432535,24.748102],
"鲁布革乡":[104.546138,24.780363],
"旧屋基乡":[104.538178,24.856088],
"钟山乡":[104.631364,24.985435],
"长底乡":[104.511816,25.036065],
"老厂乡":[104.369495,25.192905],
"中安镇":[104.260991,25.669391],
"营上镇":[104.327937,25.48231],
"黄泥河镇":[104.718073,25.279376],
"竹园镇":[104.316193,25.404821],
"后所镇":[104.303682,25.805985],
"大河镇":[104.309977,25.554165],
"墨红镇":[104.162011,25.381415 ],
"富村镇":[104.465531,25.380418],
"十八连山镇":[104.58325,25.139503],
"老厂镇":[104.531399,25.23022],
"古敢乡":[104.806593,25.223106],
"金钟镇":[103.313081,26.41755],
"娜姑镇":[103.155038,26.519931],
"乐业镇":[103.553353,26.724064],
"矿山镇":[103.687994,26.625365],
"大井镇":[103.829255,26.476095],
"待补镇":[103.434675,26.199639],
"迤车镇":[103.522609,26.820143],
"者海镇":[103.631919,26.558086],
"大海乡":[103.237579,26.300219],
"老厂乡":[103.177573,26.602626],
"五星乡":[103.259381,26.546777],
"大桥乡":[103.341488,26.691621],
"纸厂乡":[103.477117,26.9448],
"马路乡":[103.660262,26.916829],
"火红乡":[103.66162,26.827796],
"新街乡":[103.538891,26.396927],
"雨碌乡":[103.590528,26.37352],
"鲁纳乡":[103.625039,26.257835],
"上村乡":[103.576629,26.130578],
"驾车乡":[103.371528,25.9904],
"田坝乡":[103.510178,25.967551],
"西平镇":[103.829798,25.61201],
"白水镇":[103.809185,25.593418],
"盘江镇":[103.856901,25.570598],
"炎方乡":[104.023462,25.658357],
"播乐乡":[103.842255,25.756799],
"大坡乡":[104.045298,25.922991],
"菱角乡":[104.129547,25.835432],
"德泽乡":[103.6708,25.686079],
"宛水街道":[104.107764,26.22037],
"西宁街道":[104.101331,26.240723],
"双龙街道":[104.118538,26.244503],
"虹桥街道":[104.101529,26.16146],
"板桥镇":[104.081659,26.091358],
"来宾镇":[104.163563,26.319673],
"格宜镇":[104.400853,26.320693],
"田坝镇":[104.454719,26.173128],
"羊场镇":[104.258889,26.01084],
"倘塘镇":[104.221654,26.488146],
"落水镇":[104.003329,26.159135],
"务德镇":[103.728886,26.267345],
"海岱镇":[104.354289,26.076236],
"龙场镇":[104.262986,26.306319],
"龙潭镇":[104.012641,26.412982],
"热水镇":[103.780913,26.073927],
"宝山镇":[104.47981,26.317901],
"东山镇":[104.272582,26.111191],
"普立乡":[104.564753,26.360967],
"西泽乡":[103.859034,26.2453],
"得禄乡":[103.967486,26.47453],
"杨柳乡":[104.283458,26.622546],
"双河乡":[104.419276,26.619099],
"乐丰乡":[104.397155,26.495681],
"文兴乡":[104.517291,26.45539],
"阿都乡":[104.496168,26.531388]
};
var geoData=[
             {name: "南宁街道", value:90975},
             {name: "建宁街道", value:80925},
             {name: "白石江街道", value:91952},
             {name: "寥廓街道", value:102639},
             {name: "西城街道", value:47177},
             {name: "三宝镇", value:59301},
             {name: "越州镇", value:71451},
             {name: "东山镇", value:81489},
             {name: "珠街乡", value:45569},
             {name: "沿江乡", value:40209},
             {name: "茨营乡", value:29060},
             {name: "通泉镇", value:55268},
             {name: "王家庄镇", value:28662},
             {name: "旧县镇", value:26219},
             {name: "马过河镇", value:12967},
             {name: "纳章镇", value:12868},
             {name: "马鸣乡", value:12169},
             {name: "大庄乡", value:12043},
             {name: "月望乡", value:24793},
             {name: "中枢镇", value:125521},
             {name: "板桥镇", value:86975},
             {name: "三岔河镇", value:107623},
             {name: "马街镇", value:100428},
             {name: "召夸镇", value:31347},
             {name: "大莫古镇", value:45807},
             {name: "芳华镇", value:35483},
             {name: "小百户镇", value:39139},
             {name: "活水乡", value:21867},
             {name: "龙海乡", value:25014},
             {name: "陆良华侨管理区", value:3193},
             {name: "丹凤镇", value:118696},
             {name: "雄壁镇", value:54312},
             {name: "葵山镇", value:36632},
             {name: "彩云镇", value:39191},
             {name: "竹基镇", value:48997},
             {name: "龙庆乡", value:37165},
             {name: "五龙乡", value:30249},
             {name: "高良乡", value:27119},
             {name: "罗雄镇", value:136431},
             {name: "九龙镇", value:75615},
             {name: "板桥镇", value:43825},
             {name: "马街镇", value:56894},
             {name: "富乐镇", value:42001},
             {name: "阿岗镇", value:70288},
             {name: "大水井乡", value:21606},
             {name: "鲁布革乡", value:17609},
             {name: "旧屋基乡", value:10530},
             {name: "钟山乡", value:27832},
             {name: "长底乡", value:13164},
             {name: "老厂乡", value:33885},
             {name: "中安镇", value:125701},
             {name: "营上镇", value:73541},
             {name: "黄泥河镇", value:56551},
             {name: "竹园镇", value:45583},
             {name: "后所镇", value:68322},
             {name: "大河镇", value:77198},
             {name: "墨红镇", value:58840},
             {name: "富村镇", value:88230},
             {name: "十八连山镇", value:68522},
             {name: "老厂镇", value:48533},
             {name: "古敢乡", value:11619},
             {name: "金钟镇", value:154328},
             {name: "娜姑镇", value:61124},
             {name: "乐业镇", value:70209},
             {name: "矿山镇", value:23559},
             {name: "大井镇", value:38243},
             {name: "待补镇", value:40779},
             {name: "迤车镇", value:81784},
             {name: "者海镇", value:92108},
             {name: "大海乡", value:24106},
             {name: "老厂乡", value:19925},
             {name: "五星乡", value:29498},
             {name: "大桥乡", value:30816},
             {name: "纸厂乡", value:16729},
             {name: "马路乡", value:26128},
             {name: "火红乡", value:32223},
             {name: "新街乡", value:26948},
             {name: "雨碌乡", value:34478},
             {name: "鲁纳乡", value:18065},
             {name: "上村乡", value:33721},
             {name: "驾车乡", value:22373},
             {name: "田坝乡", value:31148},
             {name: "西平镇", value:124670},
             {name: "白水镇", value:38740},
             {name: "盘江镇", value:76483},
             {name: "炎方乡", value:41937},
             {name: "播乐乡", value:36268},
             {name: "大坡乡", value:46737},
             {name: "菱角乡", value:48694},
             {name: "德泽乡", value:17529},
             {name: "宛水街道", value:80106},
             {name: "西宁街道", value:57452},
             {name: "双龙街道", value:69853},
             {name: "虹桥街道", value:15999},
             {name: "板桥镇", value:63947},
             {name: "来宾镇", value:69055},
             {name: "格宜镇", value:48124},
             {name: "田坝镇", value:63139},
             {name: "羊场镇", value:53588},
             {name: "倘塘镇", value:79641},
             {name: "落水镇", value:36910},
             {name: "务德镇", value:40155},
             {name: "海岱镇", value:53861},
             {name: "龙场镇", value:50996},
             {name: "龙潭镇", value:51721},
             {name: "热水镇", value:76135},
             {name: "宝山镇", value:55388},
             {name: "东山镇", value:47987},
             {name: "普立乡", value:29092},
             {name: "西泽乡", value:35524},
             {name: "得禄乡", value:32828},
             {name: "杨柳乡", value:38248},
             {name: "双河乡", value:27042},
             {name: "乐丰乡", value:47421},
             {name: "文兴乡", value:48949},
             {name: "阿都乡", value:29730}
                     ];
var convertData = function (data) {
    var res = [];
    for (var i = 0; i < data.length; i++) {
        var geoCoord = geoCoordMap[data[i].name];
        if (geoCoord) {
            res.push({
                name: data[i].name,
                value: geoCoord.concat(data[i].value)
            });
        }
    }
    return res;
};    

	$.get('js/qujing.json', function(
				chinaJson) {
			echarts.registerMap('qujing', chinaJson);
			var chart = echarts.init(document.getElementById('fenbu1'));
			option = {
    legend: {
    	show:true,
        orient: 'vertical',
        y: 'bottom',
        x:'right',
        data:['人口'],
        textStyle: {
            color: '#fff'
        }
    },
    tooltip : {
        trigger: 'item'
    },

    geo: {
        map: 'qujing',
        label: {
            emphasis: {
                show: false
            }
        },
        roam: false,
        itemStyle: {
            normal: {
                areaColor: '#145f8e',
                borderColor: '#c9c9c9'
            },
            emphasis: {
                areaColor: '#32349B'
            }
        },
        left:20,
        right:20,
        top:20,
        bottom:20
    },
    series: {
        name: '人口',
        type: 'effectScatter',
        showEffectOn: 'render',
        rippleEffect: {
            brushType: 'stroke'
        },
        hoverAnimation: true,        
        coordinateSystem: 'geo',
        symbolSize: function (val) {
            return val[2] / 1800;
        },
        data: convertData(geoData),
        itemStyle: {
            normal: {
                color: '#c6e9fa'
            }
        },
        label: {
            normal: {
                formatter: '{b}',
                position: 'right',
                show: false
            },
            emphasis: {
                formatter: '{b}',
                position: 'right',
                show: true
            }
        }
    }

};
			chart.setOption(option);
			chart.on('click', function (params) {
				  $.getJSON('js/shenyang.json', function (data) {
					  chart.clear();
				        echarts.registerMap('shenyang', data);
//				        var chart = echarts.init(document.getElementById('fenbu1'));
				        chart.setOption({
				            series: [{
				                type: 'map',
				                map: 'shenyang'
				            }]
				        });
				    }); 
			});
	});
	
	
})